function solve() {

  let input = document
    .getElementById("input")        
    .value.split(".")       // вземаме си текста от инпут полето, разделяме го на изречения
    .filter((x) => x.length > 0); // и си запазваме за изречения само тези елементи, които имат поне един символ;

  let div = document.getElementById("output");  // взимаме си референция към див-а

  for (let i = 0; i < input.length; i += 3) {  // интерираме нов абзац след всяко 3то изречение;
    let sentences = [];                        // създаваме си масив в койтйо да съберем до 3 изречения за параграфа;

    for (let x = 0; x < 3; x++) {  // броим до 3 изречения
      if (input[i + x]) {         // и проверяваме дали съществува във текущия i параграф, изречение номер х.
        sentences.push(input[i + x]);  // ако има такова изречение го добавяме към масива ни;
      }
    }

    let paragraph = sentences.join(". ") + "."; // след като сме събрали до 3 изречения, ги съединяваме в параграф;
    div.innerHTML += `<p>${paragraph}</p>`; // добавяме текущия параграф към div елемента и продължаваме със следващия параграф;

  }
}
